#define _CRT_SECURE_NO_WARNINGS

#include <vector>
#include <algorithm>

using namespace std;

//分发饼干
//假设你是一位很棒的家长，想要给你的孩子们一些小饼干。但是，每个孩子最多只能给一块饼干。
//对每个孩子 i，都有一个胃口值 g[i]，这是能让孩子们满足胃口的饼干的最小尺寸；并且每块饼干 j，都有一个尺寸 s[j] 。如果 s[j] >= g[i]，我们可以将这个饼干 j 分配给孩子 i ，这个孩子会得到满足。你的目标是满足尽可能多的孩子，并输出这个最大数值。
//
//示例 1:
//输入: g = [1,2,3], s = [1,1]
//输出: 1
//解释: 
//你有三个孩子和两块小饼干，3 个孩子的胃口值分别是：1,2,3。
//虽然你有两块小饼干，由于他们的尺寸都是 1，你只能让胃口值是 1 的孩子满足。
//所以你应该输出 1。
//
//示例 2:
//输入: g = [1,2], s = [1,2,3]
//输出: 2
//解释: 
//你有两个孩子和三块小饼干，2 个孩子的胃口值分别是 1,2。
//你拥有的饼干数量和尺寸都足以让所有孩子满足。
//所以你应该输出 2。

//贪心策略：这道题的贪心策略和《优势洗牌》很相像，先将两个数组进行排序，如果饼干的尺寸大于等于孩子的胃口，那么就直接喂，如果小于，那就不用这块饼干（因为都是升序排序过的，当前的如果都小于孩子的胃口，那么后面的孩子胃口更大）
//用双指针来遍历饼干和孩子胃口，记录匹配的最大个数
class Solution {
public:
    int findContentChildren(vector<int>& g, vector<int>& s) {
        sort(g.begin(), g.end());
        sort(s.begin(), s.end());

        int m = g.size(), n = s.size();
        int ret = 0, j = 0;
        for (int i = 0; i < n; i++)
        {
            if (j < m && s[i] >= g[j])
            {
                ret++;
                j++;
            }
        }
        return ret;
    }
};