#define _CRT_SECURE_NO_WARNINGS

#include <vector>

using namespace std;

//不同路径_3
//在二维网格 grid 上，有 4 种类型的方格：
//
//1 表示起始方格。且只有一个起始方格。
//2 表示结束方格，且只有一个结束方格。
//0 表示我们可以走过的空方格。
//- 1 表示我们无法跨越的障碍。
//返回在四个方向（上、下、左、右）上行走时，从起始方格到结束方格的不同路径的数目。
//
//每一个无障碍方格都要通过一次，但是一条路径中不能重复通过同一个方格。//这道题的关键
//
//示例 1：
//输入： [[1, 0, 0, 0], [0, 0, 0, 0], [0, 0, 2, -1]]
//输出：2
//解释：我们有以下两条路径：
//1. (0, 0), (0, 1), (0, 2), (0, 3), (1, 3), (1, 2), (1, 1), (1, 0), (2, 0), (2, 1), (2, 2)
//2. (0, 0), (1, 0), (2, 0), (2, 1), (1, 1), (0, 1), (0, 2), (0, 3), (1, 3), (1, 2), (2, 2)
//
//示例 2：
//输入： [[1, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 2]]
//输出：4
//解释：我们有以下四条路径：
//1. (0, 0), (0, 1), (0, 2), (0, 3), (1, 3), (1, 2), (1, 1), (1, 0), (2, 0), (2, 1), (2, 2), (2, 3)
//2. (0, 0), (0, 1), (1, 1), (1, 0), (2, 0), (2, 1), (2, 2), (1, 2), (0, 2), (0, 3), (1, 3), (2, 3)
//3. (0, 0), (1, 0), (2, 0), (2, 1), (2, 2), (1, 2), (1, 1), (0, 1), (0, 2), (0, 3), (1, 3), (2, 3)
//4. (0, 0), (1, 0), (2, 0), (2, 1), (1, 1), (0, 1), (0, 2), (0, 3), (1, 3), (1, 2), (2, 2), (2, 3)
//
//示例 3：
//输入： [[0, 1], [2, 0]]
//输出：0
//解释：
//没有一条路能完全穿过每一个空的方格一次。
//请注意，起始和结束方格可以位于网格中的任意位置。

//与前两题解法一模一样
class Solution {
    int dx[4] = { 0,0,-1,1 };
    int dy[4] = { -1,1,0,0 };
    vector<vector<bool>> visit;
    int m, n, ret = 0, step = 0;
public:
    int uniquePathsIII(vector<vector<int>>& grid) {
        m = grid.size(), n = grid[0].size();
        visit.resize(m, vector<bool>(n));

        //记录除-1外所有点的个数且标记起点的坐标
        int bx = 0, by = 0;
        for (int i = 0; i < m; i++)
            for (int j = 0; j < n; j++)
            {
                if (grid[i][j] != -1)
                    step++;
                if (grid[i][j] == 1)
                {
                    bx = i;
                    by = j;
                }
            }

        //由于此题的起点只有数字1，所以不用在循环里dfs
        visit[bx][by] = true;
        dfs(grid, bx, by, 1);
        visit[bx][by] = false;
        return ret;
    }

    void dfs(vector<vector<int>>& grid, int bi, int bj, int count)
    {
        //递归出口
        if (grid[bi][bj] == 2)
        {
            if (count == step)
            {
                ret++;
                return;
            }
        }

        for (int k = 0; k < 4; k++)
        {
            int x = bi + dx[k], y = bj + dy[k];
            if (x >= 0 && x < m && y >= 0 && y < n && grid[x][y] != -1 && !visit[x][y])
            {
                visit[x][y] = true;
                dfs(grid, x, y, count + 1);
                visit[x][y] = false;
            }
        }
    }
};