#define _CRT_SECURE_NO_WARNINGS

#include <vector>

using namespace std;

//有效的数独
//请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
//
//数字 1 - 9 在每一行只能出现一次。
//数字 1 - 9 在每一列只能出现一次。
//数字 1 - 9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
//
//注意：
//一个有效的数独（部分已被填充）不一定是可解的。
//只需要根据以上规则，验证已经填入的数字是否有效即可。
//空白格用 '.' 表示。
//
//示例 1：
//输入：board =
//[["5", "3", ".", ".", "7", ".", ".", ".", "."]
//, ["6", ".", ".", "1", "9", "5", ".", ".", "."]
//, [".", "9", "8", ".", ".", ".", ".", "6", "."]
//, ["8", ".", ".", ".", "6", ".", ".", ".", "3"]
//, ["4", ".", ".", "8", ".", "3", ".", ".", "1"]
//, ["7", ".", ".", ".", "2", ".", ".", ".", "6"]
//, [".", "6", ".", ".", ".", ".", "2", "8", "."]
//, [".", ".", ".", "4", "1", "9", ".", ".", "5"]
//, [".", ".", ".", ".", "8", ".", ".", "7", "9"]]
//输出：true
//
//示例 2：
//输入：board =
//[["8", "3", ".", ".", "7", ".", ".", ".", "."]
//, ["6", ".", ".", "1", "9", "5", ".", ".", "."]
//, [".", "9", "8", ".", ".", ".", ".", "6", "."]
//, ["8", ".", ".", ".", "6", ".", ".", ".", "3"]
//, ["4", ".", ".", "8", ".", "3", ".", ".", "1"]
//, ["7", ".", ".", ".", "2", ".", ".", ".", "6"]
//, [".", "6", ".", ".", ".", ".", "2", "8", "."]
//, [".", ".", ".", "4", "1", "9", ".", ".", "5"]
//, [".", ".", ".", ".", "8", ".", ".", "7", "9"]]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。

//这题是下一题《解数独》的前导题，和回溯没有关系，只是后面剪枝要用到此题的优化思想
class Solution {
    //优化：用三个类似哈希表功能的数组来标记某一个数在某一行，某一列，某一个3*3方格中是否已经存在了
    bool row[9][10];
    bool col[9][10];
    bool grid[3][3][10];
public:
    bool isValidSudoku(vector<vector<char>>& board) {
        for (int i = 0; i < 9; i++)
            for (int j = 0; j < 9; j++)
                if (board[i][j] != '.')
                {
                    int num = board[i][j] - '0';
                    if (row[i][num] || col[j][num] || grid[i / 3][j / 3][num])//3*3方格的下标用正常9*9的下标/3即可
                        return false;

                    row[i][num] = true;
                    col[j][num] = true;
                    grid[i / 3][j / 3][num] = true;
                }

        return true;
    }
};