#define _CRT_SECURE_NO_WARNINGS


#include <vector>

//编写一个程序，通过填充空格来解决数独问题。
//
//数独的解法需 遵循如下规则：
//
//数字 1 - 9 在每一行只能出现一次。
//数字 1 - 9 在每一列只能出现一次。
//数字 1 - 9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
//数独部分空格内已填入了数字，空白格用 '.' 表示。
//
//示例 1：
//
//输入：board = [["5", "3", ".", ".", "7", ".", ".", ".", "."], ["6", ".", ".", "1", "9", "5", ".", ".", "."], [".", "9", "8", ".", ".", ".", ".", "6", "."], ["8", ".", ".", ".", "6", ".", ".", ".", "3"], ["4", ".", ".", "8", ".", "3", ".", ".", "1"], ["7", ".", ".", ".", "2", ".", ".", ".", "6"], [".", "6", ".", ".", ".", ".", "2", "8", "."], [".", ".", ".", "4", "1", "9", ".", ".", "5"], [".", ".", ".", ".", "8", ".", ".", "7", "9"]]
//输出： [["5", "3", "4", "6", "7", "8", "9", "1", "2"], ["6", "7", "2", "1", "9", "5", "3", "4", "8"], ["1", "9", "8", "3", "4", "2", "5", "6", "7"], ["8", "5", "9", "7", "6", "1", "4", "2", "3"], ["4", "2", "6", "8", "5", "3", "7", "9", "1"], ["7", "1", "3", "9", "2", "4", "8", "5", "6"], ["9", "6", "1", "5", "3", "7", "2", "8", "4"], ["2", "8", "7", "4", "1", "9", "6", "3", "5"], ["3", "4", "5", "2", "8", "6", "1", "7", "9"]]

using namespace std;

//虽然有前导题的剪枝思想，但这道题还是做的很迷，思路很乱，还是有很多小细节需要注意
//决策树就是从一个空位开始从1-9依次作为分支，依次去试，然后根据三个bool数组进行剪枝
class Solution {
    bool row[9][10];
    bool col[9][10];
    bool grid[3][3][10];
    vector<pair<int, int>> spot;
public:
    void solveSudoku(vector<vector<char>>& board) {
        for (int i = 0; i < 9; i++)
            for (int j = 0; j < 9; j++)
            {
                if (board[i][j] != '.')
                {
                    int num = board[i][j] - '0';
                    row[i][num] = true;
                    col[j][num] = true;
                    grid[i / 3][j / 3][num] = true;
                }
                else
                    spot.push_back({ i,j });
            }

        dfs(board, 0);
    }

    bool dfs(vector<vector<char>>& board, int pos)
    {
        if (pos == spot.size())
            return true;

        auto [i, j] = spot[pos];//和大神题解学到的小优化，正常的思考是这里也需要再次两次for循环去找每一个空位，但可以设置一个存空位坐标的pair的数组，在上面初始化三个数组时，顺带把这个存空位坐标的数组也初始化
        //这样这里就可以直接取空位坐标了
        for (int num = 1; num <= 9; num++)
        {
            if (!row[i][num] && !col[j][num] && !grid[i / 3][j / 3][num])
            {
                row[i][num] = col[j][num] = grid[i / 3][j / 3][num] = true;
                board[i][j] = num + '0';
                //这一步需要好好理解，就是这一步让我很迷
                //思想是要判断这个数字填这个空位之后，接下来的递归是否能“走通”，即接下来是否能填出正确结果
                //如果能走通，即一直返回true，回到这一层时，直接返回true退出
                //如果到某一个空格走不通了，即从1到9填进去都不满足要求，返回false为假时，恢复现场，就当这一个数无事发生一样，就换下一个数填
                if (dfs(board, pos + 1))
                    return true;
                board[i][j] = '.';
                row[i][num] = col[j][num] = grid[i / 3][j / 3][num] = false;
            }
        }
        return false;//这里的返回意思是可能到某一个格子时，从1到9填进去都不满足要求，直接返回false让上层递归排除这种填法
    }
};